//(1) 원화를 입력 받아 이것이 몇 달러인지 구해서 출력하는 프로그램(1달러는 1200원으로 계산)
//(예)1800원이 입력되면 1.5달러라고 출력함
//
//(2) 원화를 입력 받아 이것이 몇 달러 몇 센트인지 출력하는 프로그램(달러와 센트는 정수로 나타냄)
//(예)1800원이 입력되면 1달러 50센트라고 출력함

//#include <iostream>
//using namespace std;
//
//int main()
//{	
//	//(1) 원화를 입력 받아 이것이 몇 달러인지 구해서 출력하는 프로그램(1달러는 1200원으로 계산)
//	//(예)1800원이 입력되면 1.5달러라고 출력함
//
//	float dollar1 = 0.0;
//	float won1;
//
//	cout << "원화 입력 : ";
//	cin >> won1;
//
//	dollar1 = won1 / 1200;
//	cout << "달러 : " << dollar1 << "달러" << endl << endl;
//
//
//	//(2) 원화를 입력 받아 이것이 몇 달러 몇 센트인지 출력하는 프로그램(달러와 센트는 정수로 나타냄)
//	//(예)1800원이 입력되면 1달러 50센트라고 출력함
//
//	int dollar2 = 0;
//	int cent = 0;
//	int won2;
//
//	cout << "원화 입력 : ";
//	cin >> won2;
//
//	dollar2 = won2 / 1200;
//	cent = (dollar1 - dollar2) * 100;
//		
//	cout << "달러, 센트 : " << dollar2 << "달러 " << cent << "센트" << endl;
//
//	return 0;
//}